import {type Event} from '@/entities/event';

export const eventsMock: Event[] = [
    {
        id: 1,
        name: 'Создание отчета',
        status: 'На проверке',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 2,
        name: 'Обновление профиля',
        status: 'Начато',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 3,
        name: 'Вход в систему',
        status: 'Завершено',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 4,
        name: 'Оплата заказа',
        status: 'Начато',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 5,
        name: 'Изменение пароля',
        status: 'Начато',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 6,
        name: 'Удаление аккаунта',
        status: 'На проверке',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 7,
        name: 'Оплата заказа',
        status: 'На проверке',
        createdAt: '2025-05-12T18:21:40.300886',
    },
    {
        id: 8,
        name: 'Вход в систему',
        status: 'Добавлено',
        createdAt: '2025-04-14T18:21:00',
    },
    {
        id: 9,
        name: 'Регистрация пользователя',
        status: 'На проверке',
        createdAt: '2025-06-01T18:21:00',
    },
    {
        id: 10,
        name: 'Изменение пароля',
        status: 'Начато',
        createdAt: '2025-04-04T18:21:00',
    },
    {
        id: 11,
        name: 'Регистрация пользователя',
        status: 'Начато',
        createdAt: '2025-04-23T18:21:00',
    },
    {
        id: 12,
        name: 'Загрузка файла',
        status: 'На проверке',
        createdAt: '2025-05-03T18:21:00',
    },
    {
        id: 13,
        name: 'Вход в систему',
        status: 'Добавлено',
        createdAt: '2025-06-22T18:21:00',
    },
    {
        id: 14,
        name: 'Добавление товара',
        status: 'Добавлено',
        createdAt: '2025-06-20T18:21:00',
    },
    {
        id: 15,
        name: 'Вход в систему',
        status: 'Добавлено',
        createdAt: '2025-06-11T18:21:00',
    },
    {
        id: 16,
        name: 'Удаление аккаунта',
        status: 'Завершено',
        createdAt: '2025-05-24T18:21:00',
    },
    {
        id: 17,
        name: 'Вход в систему',
        status: 'Начато',
        createdAt: '2025-04-17T18:21:00',
    },
    {
        id: 18,
        name: 'Добавление товара',
        status: 'Добавлено',
        createdAt: '2025-05-18T18:21:00',
    },
    {
        id: 19,
        name: 'Вход в систему',
        status: 'На проверке',
        createdAt: '2025-05-23T18:21:00',
    },
    {
        id: 20,
        name: 'Оплата заказа',
        status: 'Начато',
        createdAt: '2025-04-03T18:21:00',
    }
];